pubsub/camel/src/test/resources/camelinaction/soapOk.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--
  Licensed to the AOS Community (AOS) under one or more
  contributor license agreements.  See the NOTICE file
  distributed with this work for additional information
  regarding copyright ownership.  The AOS licenses this file
  to you under the Apache License, Version 2.0 (the 
  "License"); you may not use this file except in compliance
  with the License.  You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing,
  software distributed under the License is distributed on an
  "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  KIND, either express or implied.  See the License for the
  specific language governing permissions and limitations
  under the License.
-->
<ns2:Envelope xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns3="http://camelinaction.com/">
    <ns2:Body>
        <ns3:Order>
            <ns3:Amount>1</ns3:Amount>
            <ns3:Name>Camel in Action</ns3:Name>
            <ns3:OrderId>123</ns3:OrderId>
            <ns3:Status>OK</ns3:Status>
        </ns3:Order>
    </ns2:Body>
</ns2:Envelope>
